IRP/src/InformationRegisters/ThreadsInfo/ThreadsInfo.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ThreadsInfo</name>
  <resources>
    <name>Value</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>InputValue</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>DateStart</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>DateFinish</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>DatePut</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ErrorInfo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Token</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ThreadKey</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>State</name>
    <type>
      <types>EnumRef.ThreadState</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

IRP/src/InformationRegisters/ThreadsInfo/Forms/RecordForm/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	ThisObject.Value = GetResourceAsString(Record.ThreadKey, "Value");
	ThisObject.InputValue = GetResourceAsString(Record.ThreadKey, "InputValue");
EndProcedure

Function GetResourceAsString(ThreadKey, ResourceName)
	If Not ValueIsFilled(ThreadKey) Then
		Return "";
	EndIf;
	
	RecordSet = InformationRegisters.ThreadsInfo.CreateRecordSet();
	RecordSet.Filter.ThreadKey.Set(ThreadKey);
	RecordSet.Read();
	If RecordSet.Count() Then
		JSONWriter = New JSONWriter();
		JSONWriter.SetString();
		WriteJSON(JSONWriter, RecordSet[0][ResourceName].Get());
		JSON = JSONWriter.Close();
		Return JSON;
	Else
		Return "";
	EndIf;
EndFunction
